Revit 2024 API
ParameterTypeId.AnalyticalModelStickElementsMark Property
 "Member Number": Used for beams, braces, columns
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AnalyticalModelStickElementsMark { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalModelStickElementsMark As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalModelStickElementsMark {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace